; domain
(define (domain cell-assembly-cost)
  (:requirements :strips :typing
		 :negative-preconditions
		 :action-costs)
  (:types arm		       ;
	  position	       ; Where the arms is potentially able to go
	  holdable
	  job - object
	  
	  table - position     ; The place to attach components with arms.
	  container - position ; Has infinite capacity to store things.
	  
	  conveyor - container ; Slide things in/away. Infinite length.
	  tray - container     ; Part trays.
	  
	  machine - table      ; Tables which does specific jobs by itself.
	  machine-job - job    ; Jobs which should be done on machines.
	  base - holdable      ;
	  component - holdable ; Things which should be attatched on tables.
	  )
  (:constants carry-in - conveyor  ; the start of the base
	      carry-out - conveyor ; the goal of the base
	      table-in - table	   ; always connected to the conveyor
	      table-out - table	   ; always connected to the conveyor
	      nothing-done - job)  ; general start state of any base
  (:predicates 

   ;; arm attributes
   (reachable ?arm - arm ?to - position)
   ;; position attributes
   (connected ?from ?to - position) ;; by conveyor
   ;; job attributes
   (depends ?prev-job ?job - job)
   (job-available-at ?job - job ?pos - table)
   (uses ?job - job ?component - component)
   
   ;; state description
   (at ?obj - object ?pos - position)
   (arm-present ?pos - position)
   (base-present ?pos - position)
   
   (hold ?arm - arm ?holdable - holdable)
   (free ?arm - arm) ;; instead of (not (exists (?base) (hold ?arm ?base)))

   ;; (used ?component - component)
   
   (finished ?job - job ?base - base))

  (:functions
   (total-cost)
   (loading-cost)        ; the cost to set and eject base
   (job-cost ?job - job) ; the cost to do each job
   
   ;; slidng bases costs nothing

   (move-cost ?from ?to - position) - number)

  (:action move-arm
	   ;;   Moves the arm (?arm) from the source
	   ;; (?from) to the destination (?to). The occupied and not-
	   ;; occupied propositions enforce a mutual exclusion con-
	   ;; straint so that only one arm can occupy any given location
	   ;; at a time.
	   :parameters (?arm - arm ?from - position ?to - position)
	   :precondition (and (at ?arm ?from)
			      (not (arm-present ?to))
			      (reachable ?arm ?to))
	   :effect (and (at ?arm ?to)
			(arm-present ?to)
			(not (at ?arm ?from))
			(not (arm-present ?from))
			(increase (total-cost) (move-cost ?from ?to))))
  
  (:action eject-base
	   ;; Eject Base: Uses an arm (?arm) to grasp and pick up a
	   ;; base (?base) from a machine or a table (?pos). Resets
	   ;; the mutual exclusion constraint enforcing the rule that
	   ;; at most 1 base can be at a location (notbaseplaced ?pos)
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (at ?base ?pos)
			      (at ?arm ?pos)
			      (free ?arm))
	   :effect (and (hold ?arm ?base)
			(not (free ?arm))
			(not (base-present ?pos))
			(not (at ?base ?pos))
			(increase (total-cost) (loading-cost))))
  
  (:action set-base
	   ;; Set Base: Commands an arm (?arm) that is holding
	   ;; a particular base (?base) to set the base on a machine
	   ;; or table (?pos). Each machine/table has a mutual
	   ;; exclusion constraint ensuring at most 1 base is placed
	   ;; on it (notbaseplaced).
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (hold ?arm ?base)
			      (at ?arm ?pos)
			      (not (base-present ?pos)))
	   :effect (and (at ?base ?pos)
			(free ?arm)
			(not (hold ?arm ?base))
			(base-present ?pos)
			(increase (total-cost) (loading-cost))))

  (:action slide-base-in
	   ;; Slide Base: Uses a slide device to move a base. 
	   ;; MOD : CARRY-IN device only.
	   ;; MOD : It DOES care if the destination is already used.
	   :parameters (?base - base ?from - conveyor ?to - table)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to)
			      (not (base-present ?to)))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(base-present ?to)
			(increase (total-cost) (loading-cost))))

  (:action slide-base-out
	   ;; Slide Base: Uses a slide device to move a base. 
	   ;; MOD : CARRY-OUT device only.
	   ;; MOD : It doesn't care if the destination is already used.
	   ;; MOD : After the action the base acts like it had disappeard.
	   :parameters (?base - base ?from - table ?to - conveyor)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(not (base-present ?from))
			(increase (total-cost) (loading-cost))))
  
  (:action pickup-component
	   ;; Pick Parts by Arm: Use an arm (?arm) to pick up a part
	   ;; (?part). The part will later be used by a BaseAssem-
	   ;; blePickedPartsXByArm action (see below).
	   ;; 
	   ;; NOTE: basically, we assume there are unlimited number of
	   ;; components in trays. That's why this action lacks the
	   ;; delete effect on the place of the component.
	   :parameters (?component - component ?arm - arm ?pos - tray)
	   :precondition (and (free ?arm)
			      (at ?arm ?pos)
			      (at ?component ?pos))
	   :effect (and (hold ?arm ?component)
			(not (free ?arm))
			(increase (total-cost) (loading-cost))))
  
  (:action assemble-with-machine
	   ;; Base Assemble by Machine: Use a machine (?pos) to
	   ;; perform an assembly operation (e.g., tighten the screw) on
	   ;; a base (?base).

	   ;; The ordering constraints which are determined when the
	   ;; object is designed are encoded as a set of ordering proposi-
	   ;; tions, finished_Step_X and unfihished_Step_X, which rep-
	   ;; resent whether an assembly step X has been performed
	   ;; already.
	   :parameters (?base - base
			?machine - machine
			?job - machine-job
			?prev-job - job)
	   :precondition (and ;; machine specification
			  (job-available-at ?job ?machine)
			  ;; state specification
			  (not (finished ?job ?base))
			  (at ?base ?machine)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(increase (total-cost) (job-cost ?job))))

  (:action assemble-with-arm
	   ;; Base Assemble Picked Parts by Arm: Uses an arm
	   ;; (?arm) to attach a part (?part) to a base.
	   ;; 
	   ;; NOTE: components are not distinguished between each
	   ;;       other
	   :parameters (?component - component
			?job ?prev-job - job
			?base - base
			?arm - arm
			?pos - table)
	   :precondition (and
			  ;; job specification
			  (job-available-at ?job ?pos)
			  (uses ?job ?component)
			  ;; state specification
			  (hold ?arm ?component)
			  (at ?arm ?pos)
			  (at ?base ?pos)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(free ?arm)
			(not (hold ?arm ?component))
			(increase (total-cost) (job-cost ?job)))))

; problem
(define (problem cell-assembly-with-cost-p1)
  (:domain cell-assembly-cost)
  (:objects arm - arm
	    b1 - base
	    part-a
	    part-b
	    part-c - component
	    
	    tray-a
	    tray-b
	    tray-c - tray
	    
	    table2 - table
	    
	    machine-a
	    machine-b - machine
	    attatch-a
	    attatch-b
	    attatch-c - job
	    screw-a
	    screw-c - machine-job
	    )
  (:init
   ;;;;;;;;;;;;;;;; ATTRIBUTES ;;;;;;;;;;;;;;;;
   ;; 
   ;; cost initialization
   (= (total-cost) 0)   ; !!! do not remove this
   (= (loading-cost) 1) ; !!! do not remove this

   ;; arm attributes
   (reachable arm table-in)   ; !!! do not remove this
   (reachable arm table-out)  ; !!! do not remove this
   (reachable arm tray-a)
   (reachable arm tray-b)
   (reachable arm tray-c)
   (reachable arm table2)
   (reachable arm machine-a)
   (reachable arm machine-b)
   ;; position attributes
   (= (MOVE-COST MACHINE-B MACHINE-A) 3) (= (MOVE-COST MACHINE-A MACHINE-B) 3)
   (= (MOVE-COST TABLE2 TRAY-C) 3) (= (MOVE-COST TRAY-C TABLE2) 3)
   (= (MOVE-COST TRAY-B TRAY-A) 3) (= (MOVE-COST TRAY-A TRAY-B) 3)
   (= (MOVE-COST TRAY-A TABLE-OUT) 3) (= (MOVE-COST TABLE-OUT TRAY-A) 3)
   (= (MOVE-COST MACHINE-A TABLE2) 4) (= (MOVE-COST TABLE2 MACHINE-A) 4)
   (= (MOVE-COST TRAY-C TRAY-B) 4) (= (MOVE-COST TRAY-B TRAY-C) 4)
   (= (MOVE-COST TABLE-OUT TABLE-IN) 4) (= (MOVE-COST TABLE-IN TABLE-OUT) 4)
   (= (MOVE-COST TRAY-B TABLE-OUT) 5) (= (MOVE-COST TABLE-OUT TRAY-B) 5)
   (= (MOVE-COST MACHINE-B TABLE2) 6) (= (MOVE-COST TABLE2 MACHINE-B) 6)
   (= (MOVE-COST MACHINE-A TRAY-C) 6) (= (MOVE-COST TRAY-C MACHINE-A) 6)
   (= (MOVE-COST TABLE2 TRAY-B) 6) (= (MOVE-COST TRAY-B TABLE2) 6)
   (= (MOVE-COST TRAY-C TRAY-A) 6) (= (MOVE-COST TRAY-A TRAY-C) 6)
   (= (MOVE-COST TRAY-A TABLE-IN) 6) (= (MOVE-COST TABLE-IN TRAY-A) 6)
   (= (MOVE-COST MACHINE-B TRAY-C) 8) (= (MOVE-COST TRAY-C MACHINE-B) 8)
   (= (MOVE-COST TABLE2 TRAY-A) 8) (= (MOVE-COST TRAY-A TABLE2) 8)
   (= (MOVE-COST TRAY-C TABLE-OUT) 8) (= (MOVE-COST TABLE-OUT TRAY-C) 8)
   (= (MOVE-COST TRAY-B TABLE-IN) 8) (= (MOVE-COST TABLE-IN TRAY-B) 8)
   (= (MOVE-COST MACHINE-A TRAY-B) 9) (= (MOVE-COST TRAY-B MACHINE-A) 9)
   (= (MOVE-COST TABLE2 TABLE-OUT) 10) (= (MOVE-COST TABLE-OUT TABLE2) 10)
   (= (MOVE-COST MACHINE-B TRAY-B) 11) (= (MOVE-COST TRAY-B MACHINE-B) 11)
   (= (MOVE-COST MACHINE-A TRAY-A) 11) (= (MOVE-COST TRAY-A MACHINE-A) 11)
   (= (MOVE-COST TRAY-C TABLE-IN) 11) (= (MOVE-COST TABLE-IN TRAY-C) 11)
   (= (MOVE-COST MACHINE-B TRAY-A) 13) (= (MOVE-COST TRAY-A MACHINE-B) 13)
   (= (MOVE-COST MACHINE-A TABLE-OUT) 13) (= (MOVE-COST TABLE-OUT MACHINE-A) 13)
   (= (MOVE-COST TABLE2 TABLE-IN) 13) (= (MOVE-COST TABLE-IN TABLE2) 13)
   (= (MOVE-COST MACHINE-B TABLE-OUT) 15) (= (MOVE-COST TABLE-OUT MACHINE-B) 15)
   (= (MOVE-COST MACHINE-A TABLE-IN) 16) (= (MOVE-COST TABLE-IN MACHINE-A) 16)
   (= (MOVE-COST MACHINE-B TABLE-IN) 18) (= (MOVE-COST TABLE-IN MACHINE-B) 18)
   (= (MOVE-COST MACHINE-B MACHINE-B) 1000)
   (= (MOVE-COST MACHINE-A MACHINE-A) 1000) (= (MOVE-COST TABLE2 TABLE2) 1000)
   (= (MOVE-COST TRAY-C TRAY-C) 1000) (= (MOVE-COST TRAY-B TRAY-B) 1000)
   (= (MOVE-COST TRAY-A TRAY-A) 1000) (= (MOVE-COST TABLE-OUT TABLE-OUT) 1000)
   (= (MOVE-COST TABLE-IN TABLE-IN) 1000)
   ;; this is awful
   ;; see make-distances.lisp
   
   ;; conveyor attributes
   (connected carry-in table-in)   ; !!! do not remove this
   (connected table-out carry-out) ; !!! do not remove this

   ;; job attributes
   (job-available-at attatch-a table-in)
   (job-available-at screw-a machine-a)
   (job-available-at attatch-b table2)
   (job-available-at attatch-c table2)
   (job-available-at screw-c machine-b)
   ;; job attributes
   (uses attatch-a part-a)
   (uses attatch-b part-b)
   (uses attatch-c part-c)
   ;; linear job ordering
   (depends nothing-done attatch-a)
   (depends attatch-a screw-a)
   (depends screw-a attatch-b)
   (depends attatch-b attatch-c)
   (depends attatch-c screw-c)

   (= (job-cost attatch-a) 5)
   (= (job-cost attatch-b) 5)
   (= (job-cost attatch-c) 5)
   (= (job-cost screw-a) 5)
   (= (job-cost screw-c) 5)
   
   ;;;;;;;;;;;;;;;; INITIAL STATES ;;;;;;;;;;;;;;;;
   ;; 
   ;;;; Bases ;;;;;;;;;
   ;; 
   ;; All bases are at CARRY-IN
   (at b1 carry-in)
   ;; Base and jobs. All bases must have finished NOTHING-DONE
   (finished nothing-done b1)

   ;;;; Components ;;;;;;;;
   ;; 
   ;; Explain where each type of components is placed.
   (at part-a tray-a)
   (at part-b tray-b)
   (at part-c tray-c)

   ;;;; Arms ;;;;;;;;;;;;;;;;
   ;; 
   ;; Initially it can be anywhere, but I suggest you to keep
   ;; them collision-free.
   (at arm table-out)
   ;; 
   ;; Arm presence. The number of these clause would be exactly the
   ;; same as that of arms.
   (arm-present table-out)
   ;; 
   ;; All arms should be free.
   (free arm))
  (:goal (and
	  ;; In the goal state, all bases should be at CARRY-OUT
	  (at b1 carry-out)
	  
	  ;; Also, all base should already passed the last job.
	  (finished screw-c b1)
	  ))
  (:metric minimize (total-cost)))

; plan
1. (slide-base-in b1 carry-in table-in)
   deleted: (at b1 carry-in)
   added: (at b1 table-in) (base-present table-in)
   goals met: 0 of 2
2. (move-arm arm table-out tray-a)
   deleted: (at arm table-out) (arm-present table-out)
   added: (at arm tray-a) (arm-present tray-a)
   goals met: 0 of 2
3. (pickup-component part-a arm tray-a)
   deleted: (free arm)
   added: (hold arm part-a)
   goals met: 0 of 2
4. (move-arm arm tray-a table-in)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm table-in) (arm-present table-in)
   goals met: 0 of 2
5. (assemble-with-arm part-a attatch-a nothing-done b1 arm table-in)
   deleted: (hold arm part-a)
   added: (finished attatch-a b1) (free arm)
   goals met: 0 of 2
6. (eject-base b1 arm table-in)
   deleted: (free arm) (base-present table-in) (at b1 table-in)
   added: (hold arm b1)
   goals met: 0 of 2
7. (move-arm arm table-in machine-a)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm machine-a) (arm-present machine-a)
   goals met: 0 of 2
8. (set-base b1 arm machine-a)
   deleted: (hold arm b1)
   added: (at b1 machine-a) (free arm) (base-present machine-a)
   goals met: 0 of 2
9. (assemble-with-machine b1 machine-a screw-a attatch-a)
   added: (finished screw-a b1)
   goals met: 0 of 2
10. (eject-base b1 arm machine-a)
   deleted: (free arm) (base-present machine-a) (at b1 machine-a)
   added: (hold arm b1)
   goals met: 0 of 2
11. (move-arm arm machine-a table2)
   deleted: (at arm machine-a) (arm-present machine-a)
   added: (at arm table2) (arm-present table2)
   goals met: 0 of 2
12. (set-base b1 arm table2)
   deleted: (hold arm b1)
   added: (at b1 table2) (free arm) (base-present table2)
   goals met: 0 of 2
13. (move-arm arm table2 tray-b)
   deleted: (at arm table2) (arm-present table2)
   added: (at arm tray-b) (arm-present tray-b)
   goals met: 0 of 2
14. (pickup-component part-b arm tray-b)
   deleted: (free arm)
   added: (hold arm part-b)
   goals met: 0 of 2
15. (move-arm arm tray-b table2)
   deleted: (at arm tray-b) (arm-present tray-b)
   added: (at arm table2) (arm-present table2)
   goals met: 0 of 2
16. (assemble-with-arm part-b attatch-b screw-a b1 arm table2)
   deleted: (hold arm part-b)
   added: (finished attatch-b b1) (free arm)
   goals met: 0 of 2
17. (move-arm arm table2 tray-c)
   deleted: (at arm table2) (arm-present table2)
   added: (at arm tray-c) (arm-present tray-c)
   goals met: 0 of 2
18. (pickup-component part-c arm tray-c)
   deleted: (free arm)
   added: (hold arm part-c)
   goals met: 0 of 2
19. (move-arm arm tray-c table2)
   deleted: (at arm tray-c) (arm-present tray-c)
   added: (at arm table2) (arm-present table2)
   goals met: 0 of 2
20. (assemble-with-arm part-c attatch-c attatch-b b1 arm table2)
   deleted: (hold arm part-c)
   added: (finished attatch-c b1) (free arm)
   goals met: 0 of 2
21. (eject-base b1 arm table2)
   deleted: (free arm) (base-present table2) (at b1 table2)
   added: (hold arm b1)
   goals met: 0 of 2
22. (move-arm arm table2 machine-b)
   deleted: (at arm table2) (arm-present table2)
   added: (at arm machine-b) (arm-present machine-b)
   goals met: 0 of 2
23. (set-base b1 arm machine-b)
   deleted: (hold arm b1)
   added: (at b1 machine-b) (free arm) (base-present machine-b)
   goals met: 0 of 2
24. (assemble-with-machine b1 machine-b screw-c attatch-c)
   added: (finished screw-c b1)
   goals met: 1 of 2
25. (eject-base b1 arm machine-b)
   deleted: (free arm) (base-present machine-b) (at b1 machine-b)
   added: (hold arm b1)
   goals met: 1 of 2
26. (move-arm arm machine-b table-out)
   deleted: (at arm machine-b) (arm-present machine-b)
   added: (at arm table-out) (arm-present table-out)
   goals met: 1 of 2
27. (set-base b1 arm table-out)
   deleted: (hold arm b1)
   added: (at b1 table-out) (free arm) (base-present table-out)
   goals met: 1 of 2
28. (slide-base-out b1 table-out carry-out)
   deleted: (at b1 table-out) (base-present table-out)
   added: (at b1 carry-out)
   goals met: 2 of 2
